<template>
  <div class="row">
    <div class="side">
      <div class="col-3 menu">
        <ul>
          <li><a href="#VOCALOID_"> 项目简介</a></li>
          <li><a href="#1">特色与成果</a></li>
          <li><a href="#2">理论开发</a></li>
          <li><a href="#3">商业规划</a></li>
          <li><a href="#4">未来展望</a></li>
        </ul>
        <!-- 定义一个 HTML 无序列表 -->
      </div>
    </div>
    <div class="main">
      <!-- 第一部分 -->
      <a id="VOCALOID_">
        <h2>“点彩成乐” 简介</h2>
      </a>
      <p>
        当今社会，人们趋向于在线上分享自己的生活，而其中抖音短视频以及图片拼贴画广受用户喜爱。然而，如何选择合适的音乐去适配画面是很多用户的困扰。配乐的低自由度和版权问题构成了用户的痛点。
      </p>
      <p>
        依托于当下的环境及需求，我们创立了“点彩成乐”项目。本项目组自主研发了多模态音乐生成框架，让每个人都有为自己的作品（图像/视频/文本）进行定制化配乐的机会，成为独一无二的创作者。
      </p>
      <br /><br /><br />
      <!-- 第一部分 -->
      <a id="1">
        <h2>特色与成果</h2>
      </a>
      <p>
        <b>项目特色：</b>
      </p>
      <p>
        <b>多模态：</b>不同于传统的音频生成框架的单一局限输入，本框架支持多模态输入与统一。基于预训练模型的强大理解能力，本框架可以抓取隐藏在多模态的关键内容，而大语言模型的桥接则提供了统一且准确的文本转译。
      </p>
      <p>
        <b>轻量化：</b>本框架无需从头开始构建和训练新的模型，节省时间资源，实现轻量化生成。对于个体用户，我们支持快速生成音频；对于企业用户，在本地化部署后，仅需足够内存支持与一般CPU即可运行。
      </p>
      <p>
        <b>模块化：</b>本框架的后端逻辑分为三个独立的模块，且各模块均可以独立更换，可以根据B端企业不同的需求，灵活修改框架中各模块的功能实现。
      </p>
      <br />
      <p>
        <b>项目成果：</b>
      </p>
      <p>
        目前本项目已经有<b><i>ACM MM</i></b>论文在投，且有完善的网页&小程序前端与轻量化后端，支持多平台使用和快速部署。
      </p>
      <p>
        *这里插入展示视频*
      </p>
      <br /><br /><br />
      <a id="2">
        <h2>理论开发</h2>
      </a>
      <p>
        “点彩成乐”的运行原理为通过预训练模型组合与调整实现多模态配乐，目前在多模态生成领域主观与客观指标评估效果优于其他生成系统。
      </p>
      <p>
        该配乐系统可以分为三个模块：多模态读取模块，大语言模型桥接模块，音频生成模块。
      </p>
      <p>
        <b>多模态读取模块：</b>
      </p>
      <p>
        该模块的作用为获取所有类型的输入（包括图像、视频、文本）并将其统一整合为描述性的文本，准确解读图像和视频的内容，同时也为用户后续的追加调整提供参考。
      </p>
      <p>
        <b>大语言模型桥接模块：</b>
      </p>
      <p>
        为进一步满足用户客制化的需求，也希望用户能够通过文本输入对生成音乐做修正，因此本项目组借助了大语言模型对系统进行语义桥接。
        该模块不仅可以解决多模态间的“异质文本”问题，也支持用户输入文本对音乐生成进行微调，使生成的AI音乐更符合用户需求。
      </p>
      <p>
        <b>音频生成模块：</b>
      </p>
      <p>
        该模块提供多种可选的音频生成方案，包括目前较为火爆的suno生成与我们基于开源模型MusicGen自主配置的多层级生成，用户可以根据自身需求选择生成方式。
      </p>
      <br /><br /><br />
      <a id="3">
        <h2>商业规划</h2>
      </a>
      <p>
        本项目组对于该生成系统计划拓展商业方向如下所述：
      </p>
      <p>
        <b>配乐生成工具：</b>我们计划为个体用户提供无版权配乐生成服务，杜绝千篇一律的“抖音神曲”，为用户提供眼前一亮的配乐，为生活增添音乐的色彩。
      </p>
      <p>
        <b>音乐交流社区：</b>我们为热爱音乐，渴望用音乐描绘生活的人们搭建了全国首创的音乐交流社区，让我们的用户通过音乐分享每日的生活。
      </p>
      <p>
        <b>技术解决方案提供商：</b>我们的框架可以直接接入社交平台或者单模态音乐生成网站，提供多模态配乐生成服务，拓宽公司业务范畴，提升客户满意度。
      </p>
      <br /><br /><br />
      <a id="4">
        <h2>未来展望</h2>
      </a>
      <p>
        本项目组通过预训练模型组合与调整，解决了多模态配乐的难题，让音乐在信息时代的浪潮中升华。<br /><br />
        本系统生成音乐的操作简单便捷，核心易于部署，有利于扩展平台发布者群体的年龄跨度，减少复杂操作带来的隔阂。<br /><br />
        随着用户数量增长，我们计划引入反馈强化学习系统，程序也将参考反馈进行调整，生成更加贴近用户需求的音乐。
      </p>
      <p>
        通过利用AI模型解决图像/视频配乐问题是本项目组的初衷，我们希望<b>让每个人都有为自己的作品进行原创配乐的机会</b>。<br /><br />
        同时，由于本系统可以提供<b>核心技术支持</b>，我们将有能力为有需求的企业提供<b>便捷的API和/或轻量化核心功能部署</b>。<br /><br />
        我们坚信，在不久的将来，“点彩成乐”将成为被广泛使用的音乐生成框架。
      </p>
    </div>
  </div>
</template>
