<template>
  <div class="row">
    <!-- 将不同的元素并列置于一行 -->
    <div class="side">
      <!-- 定义 side 类 -->
      <div class="col-3 menu">
        <ul>
          <li> <a href="#Luo_"> 【陈雪松】 简介</a> </li>
          <li> <a href="#Yan_">【徐天泽】 简介</a> </li>
          <li> <a href="#Yue_">【宁博睿】 简介</a> </li>
          <li> <a href="#Yue_">【王乙竹】 简介</a> </li>
          <li> <a href="#Yue_">【姚莘睿】 简介</a> </li>
        </ul>
        <!-- 定义一个 HTML 无序列表 -->
        <!-- 点击标签可在文中快速跳转 -->
      </div>
    </div>
    <div class="main"><!-- 第二部分 -->
      <div>
        <a name="Luo_">
          <h2>【陈雪松】简介</h2>
        </a>
        <!-- 引用图片并进行css修饰 -->
        <h3>特长</h3>
        <p>擅长文字和程序方面的工作，对C/C++，python，mySQL与PHP有一定了解。</p>
        <p>有大量各类中文文章书写经验。</p>
        <h3>项目经历</h3>
        <p>曾经参与英才计划（北大计算机）的科创类实践项目《基于原始机器学习技术的股票极性预测》。</p>
        <p>与北邮第六届雏雁计划项目《智能旅游规划系统》，自主完成后端编写并完整结题。</p>
        <h3>主要负责</h3>
        <p>后端程序构建，统筹各方面工作。</p>
      </div>
      <br><br><br><br>
      <!-- 第三部分 -->
      <div>
        <a name="Yan_">
          <h2>【徐天泽】简介</h2>
        </a>
        <h3>特长</h3>
        <p>电子商务与管理专业智育分排名第一，2021级叶培大学院成员。并熟练掌握C++、Python、Java等语言。</p>
        <p>曾获得高中生算法竞赛一等奖，蓝桥杯市级一等奖，ACM 校内排名第四等成绩。</p>
        <h3>项目经历</h3>
        <p>曾独立设计并完成线上聊天室项目、作为组长同组员设计并完成线上家政服务项目，具有一定代码逻辑架构能力、算法设计能力以及组织框架能力。</p>
        <h3>主要负责</h3>
        <p>后端程序构建，ai作曲部分。</p>
      </div>
      <br><br><br><br>
      <!-- 第四部分 -->
      <div>
        <a name="Yue_">
          <h2>【宁博睿】简介</h2>
        </a>
        <h3>特长</h3>
        <p>正在研究大数据相关技术与算法和数据库相关技术。</p>
        <p>粗略掌握Java和Python编程技术，了解人工智能与深度学习相关技术。</p>
        <p>掌握计算机合成歌曲（含人声）相关方法与接口。</p>
        <h3>项目经历</h3>
        <p>有艺术创作相关经历。精通文字处理相关方法。</p>
        <h3>主要负责</h3>
        <p>数据库搭建，模型测试。</p>
      </div>
      <br><br><br><br>
      <div>
        <a name="Yue_">
          <h2>【王乙竹】简介</h2>
        </a>
        <h3>特长</h3>
        <p>擅长音视频处理、交互式媒体设计，精通语言文字处理，了解3d图形设计。</p>
        <p>会使用C语言、Arduino、html、java完成基本程序功能，熟练使用中日英三门语言阅读相关文献。</p>
        <p>了解音乐、美术史相关知识，熟悉基本乐理，擅长艺术创作。</p>
        <h3>项目经历</h3>
        <p>参与过“网上超市系统”的设计、程序构建并承担主要工作。</p>
        <h3>主要负责</h3>
        <p>前端代码，ui交互设计，从图片到标签部分。</p>
      </div>
      <br><br><br><br>
      <div>
        <a name="Yue_">
          <h2>【姚莘睿】简介</h2>
        </a>
        <h3>特长</h3>
        <p>在平面设计方面有一定经验，粗通c语言、python。</p>
        <p>学习过深度学习的相关知识。擅长英文文献等英文长文本的检索与阅读。</p>
        <h3>项目经历</h3>
        <p>参与过使用c语言编写的网上超市系统程序制作，参与了编写、集成、调试的工作。</p>
        <h3>主要负责</h3>
        <p>论文查找，模型测试，图片识别部分。</p>
      </div>
    </div>
  </div>
</template>